# СПИСОК - изменяемый тип данных
# может содержать любые значения одновременно, в том числе другие списки любой степени вложения
# список в списке в списке в списке
first_list = [9, 'fgdf', True, [1, 2, 3]]
print(first_list)

# имеются встроенные методы

first_list = [1, 5, 8, 24, -5, 9]
print(first_list)
# .pop - реализация стека
# .sort - можно сортировать только однотипные списки

first_list.sort()
print(first_list)

print(first_list.sort())
# print(first_list)

# list.sort () сортирует список на месте, изменяя его индексы и возвращая None, тогда как sorted () 
# возвращает новый отсортированный список, оставляя исходный список неизменным. Другое отличие состоит 
# в том, что sorted () принимает любые итерации, в то время как list.sort () является методом класса 
# списка и может использоваться только со списками.

# copy копирует список, но без вложений других списков, если они были элементами первоначального списка

# =====================
# МНОЖЕСТВО = сожержит уникальные элементы
# set - множество
# это изменяемый тип данных
# difference - вычитание множеств ()
# simmetrical_difference - симметричная разность между множествами (всё, кроме общего)
# intersection - только общее
# issubset - является ли одно множество подмножеством другого


# КОРТЕЖИ - неизменяемые
# могут хранить разные данные

first_typle = [9, 'fgdf', True, [1, 2, 3]]

# можно посчитать и получить элемент с каким-то индексом
# ПРИМЕНЕНИЕ:
# - данные из бд на этапе загрузки
# - лог пароль
# - апи ключи
# - всё, чему нужно гарантировать неизменяемость

# ЗАДАЧА СОБЕСЕДОВАНИЕ
# почистить список от дубликатов

a = [1,1,1,1,1,5,5,5,5,5,7,4,7,8,8,8,8,7,7,4,4,5,5]
print(list(set(a)))
print(len(list(set(a))))
# превратить в множество и превратить обратно в список
# возвращает [1, 4, 5, 7, 8] КРУТОООООО !!!!!

# СЛОВАРИ ======================
# пара КЛЮЧ - ЗНАЧЕНИЕ

first_dict = {'Mother': 123456789, 'Father': 987654321, 'Friend': 102030405}

# mother = ключ
# ключ - неизменяемый тип данный

for key in first_dict:
    print(first_dict[key], end=', ') # выводит список значений
print()

# используется, например, для конфига, json

second_dict = first_dict.copy

print(first_dict.get('Mother'))
print(first_dict.clear())
print()

# сдвинуть 

list_1 = [1,2,3,4,5,6,7,8,9,0]
k = 3

print(len(list_1))
print(list_1[k:] + list_1[:k]) # ВЫВОД: [4, 5, 6, 7, 8, 9, 0, 1, 2, 3]

# ========================================================================================
# дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает количество 
# элементов списка, бОльших предыдущего (элемента с предыдущим номером)
print("====")
list_1020 = [0, -1, 5, 2, 3, 9, 12, 5, 8] # 5  3  9  12  8 - больше предыдущих элементов
countBigger = 0

for i in range(1, len(list_1020)):
    if list_1020[i] > list_1020[i - 1]:
        countBigger +=1
print(list_1020)
print(countBigger)

# List comprehension = ввод списка от пользователя в одну строку
# так называемоый ГЕНЕРАТОР СПИСКОВ
# фишка ПИТОНа
# int(a) сразу преобразует введённые данные в число
# split() с указанием разделителя *по умолчанию - пробел* разделяет строку на элементы списка 
# if - накладывает условие на помещение введенного значения в собираемвй список 
# (если меньше нуля, то значение в список не попадает)

# newNewList = [int(a) for a in input().split() if int(a) > 0]
# print(newNewList)

